app/controllers/api/schedulings_controller.rb

  def index
    @schedulings = Scheduling.all
---
SELECT "schedulings".* FROM "schedulings"

  def show
    @scheduling = Scheduling.find(params[:id])
---
SELECT "schedulings".* FROM "schedulings" WHERE "schedulings"."id" = ? LIMIT ?  [["id", 129344923], ["LIMIT", 1]]