app/controllers/api_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "grace@example.com"], ["LIMIT", 1]]
---
  def authenticate
    authenticate_or_request_with_http_digest do |username|
      user = User.find_by(email: username)