app/controllers/schedulings_controller.rb

SELECT "schedulings".* FROM "schedulings"
---
  def index
    @schedulings = Scheduling.all