app/controllers/concerns/authentication.rb

    def authenticate
      if authenticated_user = User.find_by(id: cookies.encrypted[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 370882803], ["LIMIT", 1]]